In [2]:
print("Hi")

Hi

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [7]:
from pandas import Series, DataFrame

In [8]:
obj = pd.Series([4, 7, -5, 3])

In [9]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [11]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a" , "c"])

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [18]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [19]:
obj2["a"]

-5

In [24]:
obj2[["a", "b", "c"]]

a   -5
b    7
c    3
dtype: int64

In [25]:
obj[[1, 2, 3]]

1    7
2   -5
3    3
dtype: int64

In [26]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [27]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [28]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [29]:
np.exp(4)

54.598150033144236

In [30]:
np.exp(12)

162754.79141900392

In [31]:
np.exp(6)

403.4287934927351

In [32]:
"b" in obj2

True

In [33]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [34]:
obj3 = pd.Series(sdata)

In [35]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [37]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
obj3.to_csv()

',0\nOhio,35000\nTexas,71000\nOregon,16000\nUtah,5000\n'

In [42]:
states = ["California", "Texas", "Oregon", "Utah"]

In [43]:
obj4 = pd.Series(sdata, index=states)

In [44]:
obj4

California        NaN
Texas         71000.0
Oregon        16000.0
Utah           5000.0
dtype: float64

In [46]:
obj4["California"] = 140000

In [47]:
obj4

California    140000.0
Texas          71000.0
Oregon         16000.0
Utah            5000.0
dtype: float64

In [48]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], "year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [49]:
frame = pd.DataFrame(data)

In [50]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [51]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [52]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [53]:
pd.DataFrame(data, columns=["year", "pop", "state"])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [56]:
frame2 = pd.DataFrame(data, columns=["year", "pop", "state", "debt"])

In [57]:
frame2

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [59]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [60]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [61]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [64]:
frame2["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [65]:
frame.loc[2]

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [66]:
frame2.loc[0]

year     2000
pop       1.5
state    Ohio
debt      NaN
Name: 0, dtype: object